# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
x = int(input('Введите номер буквы 1-26: '))
print('На этом месте находится буква ', chr(x + 96))
